{
  "dsp_spec_version": "0.0.1",
  "last_updated_by": "Denys Rocha",
  "last_updated": "2021-02-05T19:57:03.103Z",
  "entities": [
    {
      "id": "615158de-94fd-443b-92a3-456f891c74f0",
      "class": "doc",
      "type": "page",
      "name": "Cores",
      "description": "# Diretrizes\nEssas diretrizes são a estrutura sobre a qual construímos nosso sistema de como a cor é usada na Getrak. A cor diferencia nossa marca e nos ajuda a criar experiências consistentes entre os produtos.\n\n## A cor deve ser sempre acessível\nUse cores focadas e significativas para identificar exatamente o que as pessoas precisam ver. Estamos empenhados em cumprir as relações de contraste **padrão AA** das **Diretrizes de acessibilidade de conteúdo da Web**.\n\nPara fazer isso, escolha cores primárias, secundárias e estendidas que suportem a usabilidade, garantindo contraste de cor suficiente entre os elementos para que pessoas com baixa visão ou daltonismo possam ver e usar nossos produtos.\n\n## Comunicação além da estética\nEmbora valorizemos o uso esteticamente agradável da cor, valorizamos ainda mais uma comunicação clara. Nosso uso de cores deve ser sugestivo, racional e deve servir para apoiar a finalidade do conteúdo.\n\n## Cores base\nNossa paleta principal é composta de neutros, branco e azul para trazer vida à nossa marca e é usada de maneira lógica em todo o produto e marketing para guiar os olhos e destacar as partes importantes. \n\nUsamos Azul Brilhante Base (`gds-azul-brilhante #007FF`) para ações primárias, botões, links de texto, para indicar  progresso, representar uma autenticação ou fornecer uma informação. O Azul Escuro Base (`gds-azul-escuro-base #17224D`) é usado principalmente para o corpo de títulos e subtítulos, e o Branco Base (`gds-branco-base #FFFFFF`) que é utilizado para planos de fundo de página, em ícones e corpo de texto sob fundo escuro.\n\n![Cores base](https://github.com/denysrocha/getrak-dsp/blob/master/assets/cores-base.png?raw=true)\n\n## Cores secundárias\nNossa paleta de cores secundárias é formada por uma variedade de cores reservadas para diversos fins. É composta pelo Laranja avermelhado (`gds-laranja-avermelhado #C02500`), Amarelo beer (`gds-amarelo-beer #FFAA00`) e Verde ciano (`gds-verde-ciano #34B37E`), que devem ser intencionalmente usadas para fornecer **feedback** significativo sobre nossos produtos. Consulte as diretrizes de Cores Semânticas no final da página para obter mais informações.\n\n![Cores secundárias](https://github.com/denysrocha/getrak-dsp/blob/master/assets/cores-secundarias.png?raw=true)\n\nA paleta secundária também é composta pelas cores Ciano (`gds-ciano #17E9E1`), Azul aqua (`gds-azul-aqua #00B8D9`) e Violeta (`gds-violeta #7D4CE4`), ambas variantes da paleta principal e devem ser exploradas em layouts de comunicação interna e externa, assim como em ilustrações. O Azul aqua (`gds-azul-aqua #00B8D9`) pode ser usado com cautela em pequenos detalhes na construção de interfaces, como em bordas e linhas sutis.\n\n![Cores secunárias b](https://github.com/denysrocha/getrak-dsp/blob/master/assets/cores-secundarias-b.png?raw=true)\n\n## Paleta estendida\nA paleta estendida consiste nas tonalidades utilizáveis de cada cor da paleta. O uso dessas cores varia dependendo do ponto de contato, mas elas são úteis para ilustrações, gráficos e componentes no produto.\n\n### Neutros\nOs tons neutros normalmente são usados para texto e fundos sutis quando não queremos chamar muita atenção para um ponto específico ou transmitir uma informação como \"desabilitado\".\n\n#### Neutros escuros\nOs neutros escuros são muito eficazes para criar contraste e, portanto, são a cor primária usada para tipografia. Ocasionalmente, os neutros escuros são encontrados na ilustração, mas raramente dominam a paleta. Em algumas ocasiões podem ser utilizados em elementos e ilustrações em modo escuro.\n\n![Neutros escuros](https://github.com/denysrocha/getrak-dsp/blob/master/assets/neutros-escuros.png?raw=true)\n\n#### Neutros médios\n\nUse neutros médios para criar profundidade ou sombra em componentes, como em caixas de diálogo, modais e cards. Evite tons médios neutros como cores de fundo porque geralmente não há contraste suficiente para permanecer compatível com AA.  Fazemos uma excessão do Cinza (`gds-cinza #B3BAC5`) que pode ser ser usado em dicas textos de campos de entrada.\n\n![Neutros médios](https://github.com/denysrocha/getrak-dsp/blob/master/assets/neutros-medios.png?raw=true)\n\n#### Neutros claros\nUsamos neutros leves como fundos sutis para indicar vários estados interativos, como desabilitado, ou simplesmente para criar atenção secundária para um componente. Você também encontrará neutros claros em caixas de diálogo, campos de texto, modais e tags. A cor Gelo (`gds-gelo #F9F9FB`) é a única que deve ser usada em textos, sempre sob fundos escuros.\n\n![Neutros claros](https://github.com/denysrocha/getrak-dsp/blob/master/assets/neutros-claros.png?raw=true)\n\n### Vermelhos e laranjas\nCaso precise de mais variações do Vermelho alaranjado (#C02500) para fundos em mensagens negativas, estados de erro chamando atenção para informações, ou ações que bloqueiam o fluxo de trabalho, fornecemos as seguintes tonalidades abaixo. \n\n![Vermelhos e laranjas](https://github.com/denysrocha/getrak-dsp/blob/master/assets/vermelhos-e-laranjas.png?raw=true)\n\n### Amarelos\nO amarelo indica um alerta, um aviso ou que o progresso está impedido.\n\n![Amarelos](https://github.com/denysrocha/getrak-dsp/blob/master/assets/amarelos.png?raw=true)\n\n### Verdes\nUsamos o verde para indicar ações positivas, sucesso ou para comemorar uma vitória. Lembre-se de que nosso verde é muito vibrante, o que pode causar cansaço visual em grandes doses. No entanto, por causa dessa vibração, ele também pode se destacar bem entre muitos outros elementos de uma página, por isso é uma boa escolha para chamadas para ação e CTA's.\n\n![Verdes](https://github.com/denysrocha/getrak-dsp/blob/master/assets/verdes.png?raw=true)\n\n### Azuis\nO azul é usado para nos ajudar a reforçar nossa presença e unificar nossos pontos de contato do marketing ao produto. Ele está no centro de toda comunicação e deve ser usado intencionalmente, mas com moderação. Como com todas as cores da paleta, você deve estar atento aos valores de cor fornecidos nestas diretrizes.\n\nAzul é usado para indicar autenticação, conectividade ou progresso. Você encontrará o azul em mensagens, botões, navegação e ícones.\n\n![Azuis](https://github.com/denysrocha/getrak-dsp/blob/master/assets/azuis.png?raw=true)\n\n### Roxos\nO roxo indica ajuda e suporte e é usado em botões, ícones e mensagens. Também é usado para exibir links já visitados em tipografia da web e como uma cor de destaque na ilustração. No entanto, é melhor ser usado em pequenas doses na ilustração, pois às vezes pode colidir com o azul. Caso opte pelo roxo aplicado em textos, utilize o Roxo vivo `#6457c0` e se atente aos índices de opacidade dos textos.\n\n![Roxos](https://github.com/denysrocha/getrak-dsp/blob/master/assets/roxos.png?raw=true)\n\n## Cor semântica\nAs diretrizes a seguir descrevem quando usar cores no produto. A cor semântica ajuda os usuários a identificar status, ver ações, encontrar ajuda e compreender as próximas etapas. O uso consistente de cores mantém a carga cognitiva baixa e contribui para uma experiência do usuário unificada e pregnante.\n\n![Cor semântica](https://github.com/denysrocha/getrak-dsp/blob/master/assets/cor-semantica.png?raw=true)\n\n## Cores textuais\nA cor também desempenha um papel fundamental  na hierarquia tipográfica de uma interface, muitas vezes por tipos estabelecidos como:\n\n**Principal**  para a maior  parte do texto da interface, seja corpo ou cabeçalho.\n\n**Secundário** para contraste reduzido utilizaremos neutro médio para informações complementares.\n\n**Interativo** não apenas para links, mas também para botões planos.\n\n**Desativado** resultando na utilização de neutro claro.\n\n**Erro** geralmente vermelho, para o maior contraste com o ambiente.\n\n![Cores textuais](https://github.com/denysrocha/getrak-dsp/blob/master/assets/cores-textuais.png?raw=true)",
      "tags": [],
      "last_updated": "2021-02-11T12:36:53.386Z",
      "last_updated_by": "Denys Rocha"
    },
    {
      "id": "ec3b2980-f0eb-4d77-8e3f-9e40345781dd",
      "class": "doc",
      "type": "page",
      "name": "Estilos de texto",
      "description": "## Dispositivos web\n\nA [WCAG 2.0](https://www.w3.org/Translations/WCAG20-pt-br/WCAG20-pt-br-20141024/) (Web Content Accessibility Guidelines) recomenda que a fonte base do corpo de um texto na web não deve ser inferior a 12px (9pt), para que o mesmo seja legível e acessível. A mesma instituição recomenda o tamanho de fonte padrão em 16px (12pt). \n\nNa Getrak utilizaremos a fonte base Helvetica, 16px (12pt) como recomenado pela [WCAG 2.0 W3C](https://www.w3.org/Translations/WCAG20-pt-br/WCAG20-pt-br-20141024/), com uma escala de 16px x 1.125 para obter estilos de textos maiores e menores, como títulos, subtítulos, botões e legendas.\n\nA simulação pode ser feita através do site: [https://type-scale.com/](https://type-scale.com/)\n\n\n## Dispositivos mobile\n\nPara interfaces mobile, utilizaremos a fonte base Helvetica, 18px (13.5pt), pois oferece ótima escaneabilidade para este tipo de dispositivo, e utilizamos uma escala de 18px x 1.125, o que nos dá uma variação muito menor entre o corpo do texto e o título, dando um uso mais otimzado do espaço da tela do usuário, mas permanecendo com a marcação da hieraquia dos estilos de texto.\n\nO site [Medium](https://medium.com/) foi uma referência para avaliar legibilidade de textos na web e mobile.\n\n## Uso\n\nVocê pode utilizar os design tokens de tipografia, onde o número da fonte vem na proporção de pixel real com base em 16px. É tarefa de quem usar converter para uma medida relativa, como `em` ou `rem`, e no caso de dispositivo móvel, usar 18px como tamanho de fonte base multiplicado por 1.125, como dito na seção anterior. Dessa forma, todos os tamanhos aumentarão proporcionalmente.\n\n![Tipografia](https://github.com/denysrocha/getrak-dsp/blob/master/assets/tipografia.png?raw=true)\n\n## Design Tokens\n\nOs design tokens estão nomeados seguindo o padrão `gds-<elemento>-<dispositivo>`, como por exemplo: `gds-h-1-web`, ou `gds-texto-mobile`, ou até mesmo híbrido, quando um tamanho de fonte na web se repete no mobile, só que em proporções diferentes: `gds-h-2-web-h-3-mobile`.\nÉ de responsabilidade do programador criar sua folha de estilos definindo suas classes baseadas nos nesses tokens.\nNo caso do VueBootstrap, é só importar [esse arquivo](https://github.com/denysrocha/poc-gds-design-system/blob/main/src/assets/scss/text-styles.scss) que já contém as classes corretas.",
      "tags": [],
      "last_updated": "2021-02-09T12:39:00.242Z",
      "last_updated_by": "Denys Rocha"
    },
    {
      "class": "doc",
      "type": "page",
      "id": "D5BB331A-2483-4CC5-BCB7-82FFDC412B36",
      "name": "Introduction",
      "description": "# Success! Welcome to your new Design System Package (DSP)\nThis page is the introduction to your Design System Package. Use this page to welcome people to your system, [Markdown](https://commonmark.org/help/)  is fully supported to help you create whatever you need.\n\n# Start editing\nAs a DSP creator, you can enter **Edit mode** by clicking on the **Start editing** button at the bottom left. When you finish editing your docs, tokens, or components, please click on **Finish editing**. Adobe XD for Visual Studio Code will then compile your tokens to platform-specific code, and then you will be able to share the DSP package with your team.\n\nYou can edit the settings of your package on the \"DSP settings\" button, and to load a new DSP please click on the package icon at the top left.",
      "tags": []
    },
    {
      "class": "doc",
      "type": "page",
      "id": "3c496956-f086-432d-949d-6afce970c512",
      "name": "Principles",
      "description": "Edit this with the pencil icon. \n\n[Markdown](https://commonmark.org/help/) is supported to help you create great documentation for your design system.",
      "tags": []
    }
  ]
}