{
  "dsp_spec_version": "0.0.1",
  "last_updated_by": "Denys Rocha",
  "last_updated": "2021-02-05T19:57:03.103Z",
  "entities": [
    {
      "class": "doc",
      "type": "page",
      "id": "D5BB331A-2483-4CC5-BCB7-82FFDC412B36",
      "name": "Introduction",
      "description": "# Success! Welcome to your new Design System Package (DSP)\nThis page is the introduction to your Design System Package. Use this page to welcome people to your system, [Markdown](https://commonmark.org/help/)  is fully supported to help you create whatever you need.\n\n# Start editing\nAs a DSP creator, you can enter **Edit mode** by clicking on the **Start editing** button at the bottom left. When you finish editing your docs, tokens, or components, please click on **Finish editing**. Adobe XD for Visual Studio Code will then compile your tokens to platform-specific code, and then you will be able to share the DSP package with your team.\n\nYou can edit the settings of your package on the \"DSP settings\" button, and to load a new DSP please click on the package icon at the top left.",
      "tags": []
    },
    {
      "class": "doc",
      "type": "page",
      "id": "3c496956-f086-432d-949d-6afce970c512",
      "name": "Principles",
      "description": "Edit this with the pencil icon. \n\n[Markdown](https://commonmark.org/help/) is supported to help you create great documentation for your design system.",
      "tags": []
    },
    {
      "id": "ec3b2980-f0eb-4d77-8e3f-9e40345781dd",
      "class": "doc",
      "type": "page",
      "name": "Tipografia",
      "description": "## Dispositivos web\n\nA WCAG 2.0 (Web Content Accessibility Guidelines) recomenda que a fonte base do corpo de um texto na web não deve ser inferior a 12px (9pt), para que o mesmo seja legível e acessível. A mesma instituição recomenda o tamanho de fonte padrão em 16px (12pt). \n\nNa Getrak utilizaremos a fonte base Roboto, 16px (12pt) como recomenado pela WCAG 2.0 W3C, com uma escala de 16px x 1.125 para obter estilos de textos maiores e menores, como títulos, subtítulos, botões e legendas.\n\nA simulação pode ser feita através do site: https://type-scale.com/\n\n\n## Dispositivos mobile\n\nPara interfaces mobile, utilizaremos a fonte base Roboto, 18px (13.5pt), pois oferece ótima escaneabilidade para este tipo de dispositivo, e utilizamos uma escala de 18px x 1.125, o que nos dá uma variação muito menor entre o corpo do texto e o título, dando um uso mais otimzado do espaço da tela do usuário, mas permanecendo com a marcação da hieraquia dos estilos de texto.\n\nO site Medium foi uma referência para avaliar legibilidade de textos na web e mobile.",
      "tags": [],
      "last_updated": "2021-02-05T20:02:03.460Z",
      "last_updated_by": "Denys Rocha"
    }
  ]
}